TRUE
FuzzyCLIPS> (batch "bpgf8err.bat")
TRUE
FuzzyCLIPS> (printout "Hello" crlf)
[ROUTER1] Logical name Hello was not recognized by any routers
FuzzyCLIPS> (clear)
FuzzyCLIPS> (deffunction foo (?a))
FuzzyCLIPS> (foo (+ (eval "(gensym)") 2))
[ARGACCES5] Function + expected argument #1 to be of type integer or float
[PRCCODE6] This error occurred while evaluating arguments for the deffunction foo.
FALSE
FuzzyCLIPS> (clear)
FuzzyCLIPS> (defmethod foo (?a))
FuzzyCLIPS> (foo (instances))
[PRCCODE2] Functions without a return value are illegal as generic function arguments.
[PRCCODE6] This error occurred while evaluating arguments for the generic function foo.
FALSE
FuzzyCLIPS> (clear)
FuzzyCLIPS> (deffunction foo ()
  (+ ?a 2)
  (bind ?a 1))
FuzzyCLIPS> (foo)
[PRCCODE5] Variable a unbound in deffunction foo.
[ARGACCES5] Function + expected argument #1 to be of type integer or float
[PRCCODE4] Execution halted during the actions of deffunction foo.
FALSE
FuzzyCLIPS> (clear)
FuzzyCLIPS> (deffunction foo ()
  (printout t "Hi there!" crlf))
FuzzyCLIPS> (deffunction bar ()
  (foo)
  (undeffunction *))
FuzzyCLIPS> (bar)
Hi there!
[PRNTUTIL4] Unable to delete deffunction bar.
[DFFNXFUN1] WARNING: Deffunction foo only partially deleted due to usage by other constructs.
FuzzyCLIPS> (clear)
FuzzyCLIPS> (defmethod foo ()
  (undefmethod foo *))
FuzzyCLIPS> (foo)
[GENRCFUN1] Defgeneric foo cannot be modified while one of its methods is executing.
FuzzyCLIPS> (clear)
FuzzyCLIPS> (defmethod foo 1 ())
FuzzyCLIPS> (ppdefmethod foo 2)
[GENRCFUN2] Unable to find method foo #2 in function ppdefmethod.
FuzzyCLIPS> (clear)
FuzzyCLIPS> (defgeneric foo)
FuzzyCLIPS> (undefmethod foo junk)
[GENRCCOM2] Expected a valid method index in function undefmethod.
FuzzyCLIPS> (clear)
FuzzyCLIPS> (defmethod foo ()
  (+ ?a 2)
  (bind ?a 1))
FuzzyCLIPS> (foo)
[PRCCODE5] Variable a unbound in generic function foo method #1.
[ARGACCES5] Function + expected argument #1 to be of type integer or float
[PRCCODE4] Execution halted during the actions of generic function foo method #1.
FALSE
FuzzyCLIPS> (clear)
FuzzyCLIPS> (defmethod foo ())
FuzzyCLIPS> (foo 1 2)
[GENRCEXE1] No applicable methods for foo.
FALSE
FuzzyCLIPS> (clear)
FuzzyCLIPS> (call-next-method)
[GENRCEXE2] Shadowed methods not applicable in current context.
FALSE
FuzzyCLIPS> (clear)
FuzzyCLIPS> (defmethod foo ((?a INTEGER)))
FuzzyCLIPS> (foo [bogus-instance])
[GENRCEXE3] Unable to determine class of [bogus-instance] in generic function foo.
FALSE
FuzzyCLIPS> (clear)
FuzzyCLIPS> (undefmethod * 1)
[GENRCCOM3] Incomplete method specification for deletion.
FuzzyCLIPS> (clear)
FuzzyCLIPS> (instance-address [bogus-instance])
[INSFUN2] No such instance bogus-instance in function instance-address.
FALSE
FuzzyCLIPS> (clear)
FuzzyCLIPS> (defclass A (is-a USER) (role concrete))
FuzzyCLIPS> (make-instance a of A)
[a]
FuzzyCLIPS> (defglobal ?*x* = (instance-address a))
FuzzyCLIPS> (make-instance a of A)
[a]
FuzzyCLIPS> (class ?*x*)
[INSFUN4] Invalid instance-address in function class.
FALSE
FuzzyCLIPS> (clear)
FuzzyCLIPS> (defclass A (is-a USER) (role concrete))
FuzzyCLIPS> (make-instance a of A)
[a]
FuzzyCLIPS> (clear)
FuzzyCLIPS> (initialize-instance 34)
[INSFUN1] Expected a valid instance in function initialize-instance.
FALSE
FuzzyCLIPS> (clear)
FuzzyCLIPS> (defclass A (is-a USER) (role concrete)
  (multislot foo (create-accessor write)))
FuzzyCLIPS> (make-instance a of A)
[a]
FuzzyCLIPS> (mv-slot-insert a foo 1 (instances))
[a] of A
For a total of 1 instance.
()
FuzzyCLIPS> (clear)
FuzzyCLIPS> (defclass A (is-a USER) (role concrete)
  (slot foo (create-accessor write)))
FuzzyCLIPS> (make-instance a of A)
[a]
FuzzyCLIPS> (mv-slot-insert a foo 1 abc def)
[INSMULT1] Function slot-insert$ cannot be used on single-field slot foo in instance a.
FALSE
FuzzyCLIPS> (clear)
FuzzyCLIPS> (ppdefmessage-handler USER foo around)
[MSGCOM2] Unable to find message-handler foo around for class USER in function ppdefmessage-handler.
FuzzyCLIPS> (clear)
FuzzyCLIPS> (defclass A (is-a USER) (role concrete))
FuzzyCLIPS> (make-instance a of A)
[a]
FuzzyCLIPS> (defmessage-handler A foo ()
  (+ ?a 2)
  (bind ?a 1))
FuzzyCLIPS> (send [a] foo)
[PRCCODE5] Variable a unbound in message-handler foo primary in class A
[ARGACCES5] Function + expected argument #1 to be of type integer or float
[PRCCODE4] Execution halted during the actions of message-handler foo primary in class A
FALSE
FuzzyCLIPS> (clear)
FuzzyCLIPS> (defclass A (is-a USER) (role concrete)
  (slot foo (default ?NONE) (create-accessor write)))
FuzzyCLIPS> (make-instance a of A)
[INSMNGR14] Override required for slot foo in instance a.
[PRCCODE4] Execution halted during the actions of message-handler init primary in class USER
[INSMNGR8] An error occurred during the initialization of instance a.
FALSE
FuzzyCLIPS> (clear)
FuzzyCLIPS> (defclass A (is-a USER) (role concrete)
  (slot foo (default 100)
            (access read-only)))
FuzzyCLIPS> (make-instance a of A)
[a]
FuzzyCLIPS> (send [a] put-foo)
[MSGFUN1] No applicable primary message-handlers found for put-foo.
FALSE
FuzzyCLIPS> (clear)
FuzzyCLIPS> (ppinstance)
[MSGFUN4] ppinstance may only be called from within message-handlers.
FuzzyCLIPS> (clear)
FuzzyCLIPS> (defmessage-handler INTEGER print ()
  (ppinstance))
FuzzyCLIPS> (send 34 print)
[MSGFUN5] ppinstance operates only on instances.
[PRCCODE4] Execution halted during the actions of message-handler print primary in class INTEGER
FALSE
FuzzyCLIPS> (clear)
FuzzyCLIPS> (call-next-handler)
[MSGPASS1] Shadowed message-handlers not applicable in current context.
FALSE
FuzzyCLIPS> (clear)
FuzzyCLIPS> (defclass A (is-a USER) (role concrete))
FuzzyCLIPS> (make-instance a of A)
[a]
FuzzyCLIPS> (send [a] bogus-message)
[MSGFUN1] No applicable primary message-handlers found for bogus-message.
FALSE
FuzzyCLIPS> (clear)
FuzzyCLIPS> (defclass A (is-a USER) (role concrete))
FuzzyCLIPS> (defmessage-handler USER foo (?a ?b))
FuzzyCLIPS> (make-instance a of A)
[a]
FuzzyCLIPS> (send [a] foo)
[MSGFUN2] Message-handler foo primary in class USER expected exactly 2 argument(s).
FALSE
FuzzyCLIPS> (clear)
FuzzyCLIPS> (make-instance 34 of A)
[PRNTUTIL1] Unable to find class A.
FuzzyCLIPS> (clear)
FuzzyCLIPS> (defclass A (is-a USER) (role abstract))
FuzzyCLIPS> (make-instance 34 of A)
[INSMNGR3] Cannot create instances of abstract class A.
FuzzyCLIPS> (clear)
FuzzyCLIPS> (defclass A (is-a USER) (role concrete))
FuzzyCLIPS> (make-instance 34 of A)
[INSMNGR1] Expected a valid name for new instance.
FALSE
FuzzyCLIPS> (clear)
FuzzyCLIPS> (make-instance a of 34)
[INSMNGR2] Expected a valid class name for new instance.
FALSE
FuzzyCLIPS> (clear)
FuzzyCLIPS> (defclass A (is-a USER) (role concrete))
FuzzyCLIPS> (make-instance a of A (34 override-value))
[INSMNGR9] Expected a valid slot name for slot-override.
FALSE
FuzzyCLIPS> (clear)
FuzzyCLIPS> (make-instance [foo] of USER)
[INSMNGR3] Cannot create instances of abstract class USER.
FuzzyCLIPS> (clear)
FuzzyCLIPS> (defclass A (is-a USER) (role concrete)
  (slot foo (create-accessor write)))
FuzzyCLIPS> (make-instance a of A (foo 1 2 3 4))
[INSFUN7] (1 2 3 4) illegal for single-field slot foo of instance [a] found in put-foo primary in class A.
[PRCCODE4] Execution halted during the actions of message-handler put-foo primary in class A
FALSE
FuzzyCLIPS> (clear)
FuzzyCLIPS> (defclass A (is-a USER) (role concrete))
FuzzyCLIPS> (defmessage-handler A delete around ()
  (if (neq (instance-name ?self) [a]) then
    (call-next-handler)))
FuzzyCLIPS> (make-instance a of A)
[a]
FuzzyCLIPS> (make-instance a of A)
[INSMNGR5] Unable to delete old instance a.
FALSE
FuzzyCLIPS> (undefmessage-handler A delete around)
FuzzyCLIPS> (clear)
FuzzyCLIPS> (defclass A (is-a USER) (role concrete))
FuzzyCLIPS> (make-instance a of A)
[a]
FuzzyCLIPS> (defmessage-handler A init after ()
   (initialize-instance ?self))
FuzzyCLIPS> (initialize-instance a)
[INSMNGR7] Instance a is already being initialized.
[PRCCODE4] Execution halted during the actions of message-handler init after in class A
[INSMNGR8] An error occurred during the initialization of instance a.
FALSE
FuzzyCLIPS> (clear)
FuzzyCLIPS> (defclass A (is-a USER) (role concrete)
  (slot foo (create-accessor write)))
FuzzyCLIPS> (defmessage-handler A put-foo after ($?any)
  (delete-instance))
FuzzyCLIPS> (make-instance a of A (foo 2))
[INSMNGR6] Cannot delete instance a during initialization.
[PRCCODE4] Execution halted during the actions of message-handler put-foo after in class A
FALSE
FuzzyCLIPS> (clear)
FuzzyCLIPS> (defclass A (is-a USER) (role concrete)
  (slot foo (create-accessor write)))
FuzzyCLIPS> (make-instance a of A (foo (make-instance a of A)))
[INSMNGR4] The instance a has a slot-value which depends on the instance definition.
[PRCCODE6] This error occurred while evaluating arguments for the message put-foo.
FALSE
FuzzyCLIPS> 
(dribble-off)
