TRUE
FuzzyCLIPS> (batch "factsav.bat")
TRUE
FuzzyCLIPS> (clear) ; Test error conditions for load/save facts
FuzzyCLIPS> (save-facts)
[ARGACCES4] Function save-facts expected at least 1 argument(s)
FuzzyCLIPS> (save-facts 7)
[ARGACCES5] Function save-facts expected argument #1 to be of type symbol or string
FuzzyCLIPS> (save-facts blah.tmp 7)
[ARGACCES5] Function save-facts expected argument #2 to be of type symbol
FuzzyCLIPS> (save-facts blah.tmp hello)
[ARGACCES5] Function save-facts expected argument #2 to be of type symbol with value local or visible
FALSE
FuzzyCLIPS> (save-facts blah.tmp local bogus)
[ARGACCES5] Function save-facts expected argument #3 to be of type local deftemplate name
FALSE
FuzzyCLIPS> (remove blah.tmp)
TRUE
FuzzyCLIPS> (save-facts blah.tmp)
TRUE
FuzzyCLIPS> (load-facts)
[ARGACCES4] Function load-facts expected exactly 1 argument(s)
FuzzyCLIPS> (load-facts 7)
[ARGACCES5] Function load-facts expected argument #1 to be of type symbol or string
FuzzyCLIPS> (load-facts blah.tmp bogus)
[ARGACCES4] Function load-facts expected exactly 1 argument(s)
FuzzyCLIPS> (remove blah.tmp)
TRUE
FuzzyCLIPS> (load-facts blah.tmp)
[ARGACCES2] Function load-facts was unable to open file blah.tmp.
FALSE
FuzzyCLIPS> (clear) ; Test Saving and Reloading
FuzzyCLIPS> (load factsav.clp)
+%%+%%%+%%+
TRUE
FuzzyCLIPS> (reset)
FuzzyCLIPS> (set-current-module MAIN)
MAIN
FuzzyCLIPS> (assert (A (x 1)) (B (x 1)) (B (x 2)))
<Fact-3>
FuzzyCLIPS> (set-current-module BAR)
MAIN
FuzzyCLIPS> (assert (D (x 2)) (C (x 1)) (D (x 1)) (E (x 1)))
<Fact-7>
FuzzyCLIPS> (set-current-module WOZ)
BAR
FuzzyCLIPS> (assert (G (x 1)) (F (x 1)) (G (x 2)))
<Fact-10>
FuzzyCLIPS> (set-current-module MAIN)
WOZ
FuzzyCLIPS> (facts *)
f-0     (initial-fact) CF 1.00 
f-1     (A (x 1)) CF 1.00 
f-2     (B (x 1)) CF 1.00 
f-3     (B (x 2)) CF 1.00 
f-4     (D (x 2)) CF 1.00 
f-5     (C (x 1)) CF 1.00 
f-6     (D (x 1)) CF 1.00 
f-7     (E (x 1)) CF 1.00 
f-8     (G (x 1)) CF 1.00 
f-9     (F (x 1)) CF 1.00 
f-10    (G (x 2)) CF 1.00 
For a total of 11 facts.
FuzzyCLIPS> (facts)
f-0     (initial-fact) CF 1.00 
f-1     (A (x 1)) CF 1.00 
f-2     (B (x 1)) CF 1.00 
f-3     (B (x 2)) CF 1.00 
For a total of 4 facts.
FuzzyCLIPS> (save-facts "Temp//fctsav1.fct" visible)
TRUE
FuzzyCLIPS> (save-facts "Temp//fctsav2.fct" local A)
TRUE
FuzzyCLIPS> (set-current-module BAR)
MAIN
FuzzyCLIPS> (facts)
f-1     (A (x 1)) CF 1.00 
f-2     (B (x 1)) CF 1.00 
f-3     (B (x 2)) CF 1.00 
f-4     (D (x 2)) CF 1.00 
f-5     (C (x 1)) CF 1.00 
f-6     (D (x 1)) CF 1.00 
f-7     (E (x 1)) CF 1.00 
For a total of 7 facts.
FuzzyCLIPS> (save-facts "Temp//fctsav3.fct" local C)
TRUE
FuzzyCLIPS> (save-facts "Temp//fctsav4.fct" visible B E)
TRUE
FuzzyCLIPS> (set-current-module WOZ)
BAR
FuzzyCLIPS> (facts)
f-7     (E (x 1)) CF 1.00 
f-8     (G (x 1)) CF 1.00 
f-9     (F (x 1)) CF 1.00 
f-10    (G (x 2)) CF 1.00 
For a total of 4 facts.
FuzzyCLIPS> (save-facts "Temp//fctsav5.fct" local)
TRUE
FuzzyCLIPS> (save-facts "Temp//fctsav6.fct" visible F G E)
TRUE
FuzzyCLIPS> (set-current-module FOO)
WOZ
FuzzyCLIPS> (facts)
f-0     (initial-fact) CF 1.00 
f-1     (A (x 1)) CF 1.00 
f-2     (B (x 1)) CF 1.00 
f-3     (B (x 2)) CF 1.00 
f-7     (E (x 1)) CF 1.00 
f-9     (F (x 1)) CF 1.00 
For a total of 6 facts.
FuzzyCLIPS> (save-facts "Temp//fctsav7.fct" local)
TRUE
FuzzyCLIPS> (save-facts "Temp//fctsav8.fct" visible)
TRUE
FuzzyCLIPS> (reset)
FuzzyCLIPS> (set-current-module MAIN)
MAIN
FuzzyCLIPS> (load-facts "Temp//fctsav1.fct")
TRUE
FuzzyCLIPS> (facts *)
f-0     (initial-fact) CF 1.00 
f-1     (A (x 1)) CF 1.00 
f-2     (B (x 1)) CF 1.00 
f-3     (B (x 2)) CF 1.00 
For a total of 4 facts.
FuzzyCLIPS> (retract *)
FuzzyCLIPS> (load-facts "Temp//fctsav2.fct")
TRUE
FuzzyCLIPS> (facts *)
f-4     (A (x 1)) CF 1.00 
For a total of 1 fact.
FuzzyCLIPS> (retract *)
FuzzyCLIPS> (load-facts "Temp//fctsav3.fct")

[PRNTUTIL2] Syntax Error:  Check appropriate syntax for RHS patterns.
Function load-facts encountered an error
FALSE
FuzzyCLIPS> (facts *)
FuzzyCLIPS> (retract *)
FuzzyCLIPS> (set-current-module BAR)
MAIN
FuzzyCLIPS> (load-facts "Temp//fctsav3.fct")
TRUE
FuzzyCLIPS> (facts *)
f-5     (C (x 1)) CF 1.00 
For a total of 1 fact.
FuzzyCLIPS> (retract *)
FuzzyCLIPS> (load-facts "Temp//fctsav4.fct")
TRUE
FuzzyCLIPS> (facts *)
f-6     (B (x 1)) CF 1.00 
f-7     (B (x 2)) CF 1.00 
f-8     (E (x 1)) CF 1.00 
For a total of 3 facts.
FuzzyCLIPS> (retract *)
FuzzyCLIPS> (set-current-module WOZ)
BAR
FuzzyCLIPS> (load-facts "Temp//fctsav5.fct")
TRUE
FuzzyCLIPS> (facts *)
f-9     (G (x 1)) CF 1.00 
f-10    (F (x 1)) CF 1.00 
f-11    (G (x 2)) CF 1.00 
For a total of 3 facts.
FuzzyCLIPS> (retract *)
FuzzyCLIPS> (load-facts "Temp//fctsav6.fct")
TRUE
FuzzyCLIPS> (facts *)
f-12    (E (x 1)) CF 1.00 
f-13    (G (x 1)) CF 1.00 
f-14    (F (x 1)) CF 1.00 
f-15    (G (x 2)) CF 1.00 
For a total of 4 facts.
FuzzyCLIPS> (retract *)
FuzzyCLIPS> (set-current-module FOO)
WOZ
FuzzyCLIPS> (load-facts "Temp//fctsav7.fct")
TRUE
FuzzyCLIPS> (facts *)
FuzzyCLIPS> (retract *)
FuzzyCLIPS> (load-facts "Temp//fctsav8.fct")
TRUE
FuzzyCLIPS> (facts *)
f-16    (initial-fact) CF 1.00 
f-17    (A (x 1)) CF 1.00 
f-18    (B (x 1)) CF 1.00 
f-19    (B (x 2)) CF 1.00 
f-20    (E (x 1)) CF 1.00 
f-21    (F (x 1)) CF 1.00 
For a total of 6 facts.
FuzzyCLIPS> (retract *)
FuzzyCLIPS> (dribble-off)
