TRUE
FuzzyCLIPS> (batch "firstjoin.bat")
TRUE
FuzzyCLIPS> (clear)                     ; Sharing
FuzzyCLIPS> (watch activations)
FuzzyCLIPS> (defrule foo =>)
==> Activation 0      foo: *
FuzzyCLIPS> (agenda)
0      foo: *
For a total of 1 activation.
FuzzyCLIPS> (run)
FuzzyCLIPS> (reset)
==> Activation 0      foo: *
FuzzyCLIPS> (agenda)
0      foo: *
For a total of 1 activation.
FuzzyCLIPS> (defrule bar =>)
==> Activation 0      bar: *
FuzzyCLIPS> (agenda)
0      bar: *
0      foo: *
For a total of 2 activations.
FuzzyCLIPS> (reset)
<== Activation 0      bar: *
<== Activation 0      foo: *
==> Activation 0      bar: *
==> Activation 0      foo: *
FuzzyCLIPS> (agenda)
0      foo: *
0      bar: *
For a total of 2 activations.
FuzzyCLIPS> (clear)                     ; Bug 1
FuzzyCLIPS> (set-strategy mea)
depth
FuzzyCLIPS> (defrule r1 =>))
==> Activation 0      r1: *
FuzzyCLIPS> (defrule r7 (not (x)) =>)
==> Activation 0      r7: *
FuzzyCLIPS> (agenda)
0      r7: *
0      r1: *
For a total of 2 activations.
FuzzyCLIPS> (set-strategy lex)
mea
FuzzyCLIPS> (reset)
<== Activation 0      r1: *
<== Activation 0      r7: *
==> Activation 0      r1: *
==> Activation 0      r7: *
FuzzyCLIPS> (agenda)
0      r7: *
0      r1: *
For a total of 2 activations.
FuzzyCLIPS> (run)
FuzzyCLIPS> (set-strategy depth)
lex
FuzzyCLIPS> (clear)                     ; First CE is not
FuzzyCLIPS> (defrule foo (not (a)) =>)
==> Activation 0      foo: *
FuzzyCLIPS> (agenda)
0      foo: *
For a total of 1 activation.
FuzzyCLIPS> (assert (a))
<== Activation 0      foo: *
<Fact-1>
FuzzyCLIPS> (retract 1)
==> Activation 0      foo: *
FuzzyCLIPS> (agenda)
0      foo: *
For a total of 1 activation.
FuzzyCLIPS> (reset)
<== Activation 0      foo: *
==> Activation 0      foo: *
FuzzyCLIPS> (agenda)
0      foo: *
For a total of 1 activation.
FuzzyCLIPS> (assert (a))
<== Activation 0      foo: *
<Fact-1>
FuzzyCLIPS> (reset)
==> Activation 0      foo: *
FuzzyCLIPS> (clear)                     ; First CE is not/logical
FuzzyCLIPS> 
(defrule foo 
   (logical (not (a)))
   =>
   (assert (b)))
==> Activation 0      foo: *
FuzzyCLIPS> (watch facts)
FuzzyCLIPS> (run)
==> f-1     (b) CF 1.00 
FuzzyCLIPS> (assert (a))
==> f-2     (a) CF 1.00 
<== f-1     (b) CF 1.00 
<Fact-2>
FuzzyCLIPS> (clear)                     ; First CE is not/and
==> f-0     (initial-fact) CF 1.00 
FuzzyCLIPS> (defrule foo (not (and (a) (b))) =>)
==> Activation 0      foo: *
FuzzyCLIPS> (assert (a))
==> f-1     (a) CF 1.00 
<Fact-1>
FuzzyCLIPS> (assert (b))
==> f-2     (b) CF 1.00 
<== Activation 0      foo: *
<Fact-2>
FuzzyCLIPS> (retract 2)
<== f-2     (b) CF 1.00 
==> Activation 0      foo: *
FuzzyCLIPS> (clear)                     ; First CE is test
==> f-0     (initial-fact) CF 1.00 
FuzzyCLIPS> (defrule foo (test (> 4 3)) =>)
==> Activation 0      foo: *
FuzzyCLIPS> (defrule bar (test (< 4 3)) =>)
FuzzyCLIPS> (unwatch facts)
FuzzyCLIPS> (clear)                     ; First CE is not with test
FuzzyCLIPS> (defrule foo (not (a)) (test (> 0 1)) =>)
FuzzyCLIPS> (defrule bar (not (b)) (test (< 0 1)) =>)
==> Activation 0      bar: *
FuzzyCLIPS> (reset)
<== Activation 0      bar: *
==> Activation 0      bar: *
FuzzyCLIPS> (clear)
FuzzyCLIPS> (assert (a) (b))
<Fact-2>
FuzzyCLIPS> (defrule foo (not (a)) (test (> 0 1)) =>)
FuzzyCLIPS> (defrule bar (not (b)) (test (< 0 1)) =>)
==> Activation 0      bar: *
<== Activation 0      bar: *
FuzzyCLIPS> (reset)
==> Activation 0      bar: *
FuzzyCLIPS> (defrule foo2 (not (a)) (test (> 0 1)) (not (x)) =>)
FuzzyCLIPS> (defrule bar2 (not (b)) (test (< 0 1)) (not (x)) =>)
==> Activation 0      bar2: *,*
FuzzyCLIPS> (clear)
FuzzyCLIPS> (defrule bar (a) (not (and (test (< 5 3)) (b))) (c) =>)
FuzzyCLIPS> (matches bar)
Matches for Pattern 1
 None
Matches for Pattern 2
 None
Matches for Pattern 3
 None
Matches for Pattern 4
 None
Partial matches for CEs 1 - 2
 None
Partial matches for CEs 1 - 3
 None
Partial matches for CEs 1 (P1) , 2 (P2 - P3)
 None
Partial matches for CEs 1 (P1) , 2 (P2 - P3) , 3 (P4)
 None
Activations
 None
(0 0 0)
FuzzyCLIPS> (defrule foo (test (> 3 4)) =>)
FuzzyCLIPS> (defrule yak (test (< 3 4)) =>)
==> Activation 0      yak: *
FuzzyCLIPS> (matches foo)
Matches for Pattern 1
 None
Activations
 None
(0 0 0)
FuzzyCLIPS> (matches yak)
Matches for Pattern 1
*
Activations
*
(1 0 1)
FuzzyCLIPS> (clear)                     ; Incremental Reset exists/nand CE
FuzzyCLIPS> (defrule foo (a) (b) (c) =>)
FuzzyCLIPS> (assert (a) (b) (c) (d))
==> Activation 0      foo: f-1,f-2,f-3
<Fact-4>
FuzzyCLIPS> (defrule bar (exists (a) (b)) (d) =>)
==> Activation 0      bar: *,f-4
FuzzyCLIPS> (defrule yak (exists (a) (b)) (c) =>)
==> Activation 0      yak: *,f-3
FuzzyCLIPS> (defrule woz (not (and (a) (b))) (d) =>)
FuzzyCLIPS> (unwatch activations)       ; Done
FuzzyCLIPS> (clear)
FuzzyCLIPS> (dribble-off)
