TRUE
FuzzyCLIPS> (batch "inserr.bat")
TRUE
FuzzyCLIPS> (send)
[ARGACCES4] Function send expected at least 2 argument(s)
FuzzyCLIPS> (send object)
[ARGACCES4] Function send expected at least 2 argument(s)
FuzzyCLIPS> (send object bad-message)
[MSGFUN1] No applicable primary message-handlers found for bad-message.
FALSE
FuzzyCLIPS> (make-instance)

[PRNTUTIL2] Syntax Error:  Check appropriate syntax for instance.
FuzzyCLIPS> (make-instance 5 of USER)
[INSMNGR3] Cannot create instances of abstract class USER.
FuzzyCLIPS> (defclass TEST (is-a USER) (role concrete)
   (slot x (create-accessor write))
   (multislot y (create-accessor write)))
FuzzyCLIPS> (make-instance bad TEST)

[PRNTUTIL2] Syntax Error:  Check appropriate syntax for make-instance.
FuzzyCLIPS> (make-instance bad of)

[PRNTUTIL2] Syntax Error:  Check appropriate syntax for instance class.
FuzzyCLIPS> (make-instance (bad of TEST))

[EXPRNPSR3] Missing function declaration for bad.
FuzzyCLIPS> (make-instance ([bad] of  TEST))

[EXPRNPSR1] A function name must be a symbol
FuzzyCLIPS> (make-instance bad of TEST ())

[PRNTUTIL2] Syntax Error:  Check appropriate syntax for slot-override.
FuzzyCLIPS> (make-instance bad of TEST (bogus-slot))
[INSMNGR13] Slot bogus-slot does not exist in instance bad.
FALSE
FuzzyCLIPS> (defmessage-handler TEST init around ())
FuzzyCLIPS> (make-instance bad of TEST)
FALSE
FuzzyCLIPS> (undefmessage-handler TEST init around)
FuzzyCLIPS> (defmessage-handler TEST delete around ())
FuzzyCLIPS> (make-instance ok of TEST)
[ok]
FuzzyCLIPS> (make-instance ok of TEST)
[INSMNGR5] Unable to delete old instance ok.
FALSE
FuzzyCLIPS> (undefmessage-handler TEST delete around)
FuzzyCLIPS> (make-instance bad of TEST (x abc def))
[INSFUN7] (abc def) illegal for single-field slot x of instance [bad] found in put-x primary in class TEST.
[PRCCODE4] Execution halted during the actions of message-handler put-x primary in class TEST
FALSE
FuzzyCLIPS> (make-instance bad of TEST (x abc) (y 1 2 (+ (eval "(gensym)") 2)))
[ARGACCES5] Function + expected argument #1 to be of type integer or float
[PRCCODE6] This error occurred while evaluating arguments for the message put-y.
FALSE
FuzzyCLIPS> (clear)
FuzzyCLIPS> (definstances)

[CSTRCPSR2] Missing name for definstances construct

ERROR:
(definstances )
FuzzyCLIPS> (definstances 5)

[CSTRCPSR2] Missing name for definstances construct

ERROR:
(definstances 5
FuzzyCLIPS> (definstances bad bad-comment)

[PRNTUTIL2] Syntax Error:  Check appropriate syntax for definstances.

ERROR:
(definstances MAIN::bad
   bad-comment
FuzzyCLIPS> (definstances ok "comment")
FuzzyCLIPS> (definstances bad "comment" ())

[PRNTUTIL2] Syntax Error:  Check appropriate syntax for instance.

ERROR:
(definstances MAIN::bad "comment"
   ()
FuzzyCLIPS> (definstances bad (5))

[PRNTUTIL2] Syntax Error:  Check appropriate syntax for make-instance.

ERROR:
(definstances MAIN::bad
   (5 )
FuzzyCLIPS> (definstances bad (a))

[PRNTUTIL2] Syntax Error:  Check appropriate syntax for make-instance.

ERROR:
(definstances MAIN::bad
   (a )
FuzzyCLIPS> (definstances bad ([a]))

[PRNTUTIL2] Syntax Error:  Check appropriate syntax for make-instance.

ERROR:
(definstances MAIN::bad
   ([a] )
FuzzyCLIPS> (definstances bad (a of))

[PRNTUTIL2] Syntax Error:  Check appropriate syntax for instance class.

ERROR:
(definstances MAIN::bad
   (a of )
FuzzyCLIPS> (definstances bad1 (a of BOGUS) (b of USER))
[PRNTUTIL1] Unable to find class BOGUS.

ERROR:
(definstances MAIN::bad1
   (a of BOGUS
FuzzyCLIPS> (definstances bad2 (b of USER) (a of BOGUS))
[INSMNGR3] Cannot create instances of abstract class USER.

ERROR:
(definstances MAIN::bad2
   (b of USER
FuzzyCLIPS> (reset)
FuzzyCLIPS> (clear)
FuzzyCLIPS> (initialize-instance)

[PRNTUTIL2] Syntax Error:  Check appropriate syntax for instance.
FuzzyCLIPS> (initialize-instance 5)
[INSFUN1] Expected a valid instance in function initialize-instance.
FALSE
FuzzyCLIPS> (initialize-instance a)
[INSFUN2] No such instance a in function initialize-instance.
FALSE
FuzzyCLIPS> (initialize-instance ())

[EXPRNPSR1] A function name must be a symbol
FuzzyCLIPS> (defclass TEST (is-a USER) (role concrete)
  (slot x  (create-accessor write)
     (default-dynamic (+ (eval "(gensym)") 2))))
FuzzyCLIPS> (make-instance a of TEST)
[ARGACCES5] Function + expected argument #1 to be of type integer or float
[PRCCODE4] Execution halted during the actions of message-handler init primary in class USER
[INSMNGR8] An error occurred during the initialization of instance a.
FALSE
FuzzyCLIPS> (make-instance a of TEST (x 0))
[a]
FuzzyCLIPS> (initialize-instance a ())

[PRNTUTIL2] Syntax Error:  Check appropriate syntax for slot-override.
FuzzyCLIPS> (initialize-instance a (x abc def))
[INSFUN7] (abc def) illegal for single-field slot x of instance [a] found in put-x primary in class TEST.
[PRCCODE4] Execution halted during the actions of message-handler put-x primary in class TEST
FALSE
FuzzyCLIPS> (delete-instance 0)
[ARGACCES4] Function delete-instance expected exactly 0 argument(s)
FuzzyCLIPS> (init-slots 0)
[ARGACCES4] Function init-slots expected exactly 0 argument(s)
FuzzyCLIPS> (ppinstance 0)
[ARGACCES4] Function ppinstance expected exactly 0 argument(s)
FuzzyCLIPS> (dribble-off)
