TRUE
FuzzyCLIPS> (batch "instance.bat")
TRUE
FuzzyCLIPS> (make-instance a of A)
[a]
FuzzyCLIPS> (send [a] print)
[a] of A
(x 34)
(y abc)
FuzzyCLIPS> (make-instance [a] of A (x 65))
Old instance deleted.
Slot x set with message.
[a]
FuzzyCLIPS> (send [a] print)
[a] of A
(x 65)
(y abc)
FuzzyCLIPS> (unmake-instance [a])
Old instance deleted.
TRUE
FuzzyCLIPS> (make-instance b1 of BOGUS)
New instance received init message.
Slot a set by class.
Slot b set by class.
[b1]
FuzzyCLIPS> (make-instance b1 of BOGUS (b 45))
Deleting old copy of instance.
Slot b in instance set with put- message.
New instance received init message.
Slot a set by class.
[b1]
FuzzyCLIPS> (send [b1] put-a 1)
Slot a in instance set with put- message.
1
FuzzyCLIPS> (send [b1] put-b 2)
Slot b in instance set with put- message.
2
FuzzyCLIPS> (send [b1] print)
[b1] of BOGUS
(a 1)
(b 2)
FuzzyCLIPS> (initialize-instance [b1] (a xyz))
Slot a in instance set with put- message.
New instance received init message.
Slot b set by class.
[b1]
FuzzyCLIPS> (send [b1] print)
[b1] of BOGUS
(a xyz)
(b def)
FuzzyCLIPS> (unmake-instance [b1])
Deleting old copy of instance.
TRUE
FuzzyCLIPS> (make-instance b of B (z 0))
[b]
FuzzyCLIPS> (send [b] print)
[b] of B
(x 34)
(y 100)
(z 0)
FuzzyCLIPS> (send [b] put-x 65)
65
FuzzyCLIPS> (send [b] put-y abc)
abc
FuzzyCLIPS> (send [b] put-z "Hello world.")
"Hello world."
FuzzyCLIPS> (send [b] print)
[b] of B
(x 65)
(y abc)
(z "Hello world.")
FuzzyCLIPS> (initialize-instance b)
[INSMNGR14] Override required for slot z in instance b.
[PRCCODE4] Execution halted during the actions of message-handler init primary in class USER
[INSMNGR8] An error occurred during the initialization of instance b.
FALSE
FuzzyCLIPS> (send [b] print)
[b] of B
(x 34)
(y 100)
(z "Hello world.")
FuzzyCLIPS> (unmake-instance b)
TRUE
FuzzyCLIPS> (watch instances)
FuzzyCLIPS> (reset)
==> instance [initial-object] of INITIAL-OBJECT
==> instance [c1] of C
==> instance [gen1] of C
FuzzyCLIPS> (reset)
<== instance [initial-object] of INITIAL-OBJECT
<== instance [c1] of C
<== instance [gen1] of C
==> instance [initial-object] of INITIAL-OBJECT
==> instance [c1] of C
==> instance [gen2] of C
FuzzyCLIPS> (unwatch instances)
FuzzyCLIPS> (unmake-instance *)
TRUE
FuzzyCLIPS> (make-instance d of D)
[d]
FuzzyCLIPS> (sym-cat (send [d] get-x) def)
abcdef
FuzzyCLIPS> (send [d] put-x "New value.")
"New value."
FuzzyCLIPS> (send [d] get-x)
"New value."
FuzzyCLIPS> (unmake-instance *)
TRUE
FuzzyCLIPS> (make-instance z of Z)
[z]
FuzzyCLIPS> (instances)
[z] of Z
For a total of 1 instance.
FuzzyCLIPS> (unmake-instance *)
TRUE
FuzzyCLIPS> (unwatch all)
FuzzyCLIPS> (watch messages)
FuzzyCLIPS> (make-instance sv of SAVE-TEST (stamp 1))
MSG >> create ED:1 (<Instance-sv>)
MSG << create ED:1 (<Instance-sv>)
[MSGFUN1] No applicable primary message-handlers found for put-stamp.
FALSE
FuzzyCLIPS> (make-instance sv of SAVE-TEST)
MSG >> create ED:1 (<Instance-sv>)
MSG << create ED:1 (<Instance-sv>)
MSG >> init ED:1 (<Instance-sv>)
MSG << init ED:1 (<Instance-sv>)
[sv]
FuzzyCLIPS> (save-instances "Temp//ins.tmp")
1
FuzzyCLIPS> (load-instances "Temp//ins.tmp")
MSG >> delete ED:1 (<Instance-sv>)
MSG << delete ED:1 (<Stale Instance-sv>)
MSG >> create ED:1 (<Instance-sv>)
MSG << create ED:1 (<Instance-sv>)
[MSGFUN1] No applicable primary message-handlers found for put-stamp.
[INSFILE1] Function load-instances could not completely process file Temp//ins.tmp.
0
FuzzyCLIPS> (instances)
FuzzyCLIPS> (restore-instances "Temp//ins.tmp")
1
FuzzyCLIPS> (instances)
[sv] of SAVE-TEST
For a total of 1 instance.
FuzzyCLIPS> (send [sv] print)
MSG >> print ED:1 (<Instance-sv>)
[sv] of SAVE-TEST
(stamp 26959.7) ;; Different number is OK
MSG << print ED:1 (<Instance-sv>)
FuzzyCLIPS> (dribble-off)
